In [1]:
import pandas as pd
from sklearn import linear_model

In [2]:
df1= pd.read_csv('hiring.csv')
df1

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [3]:
from word2number import w2n
df1

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [4]:
df1.rename(columns={'experience':'exp','test_score(out of 10)':'tscore','interview_score(out of 10)':'iscore','salary($)':'salary'},inplace=True)
df1

      exp  tscore  iscore  salary
0     NaN     8.0       9   50000
1     NaN     8.0       6   45000
2    five     6.0       7   60000
3     two    10.0      10   65000
4   seven     9.0       6   70000
5   three     7.0      10   62000
6     ten     NaN       7   72000
7  eleven     7.0       8   80000

In [5]:
df1['exp']= df1['exp'].fillna('zero')

In [6]:
df1.exp=df1.exp.apply(w2n.word_to_num)
df1

   exp  tscore  iscore  salary
0    0     8.0       9   50000
1    0     8.0       6   45000
2    5     6.0       7   60000
3    2    10.0      10   65000
4    7     9.0       6   70000
5    3     7.0      10   62000
6   10     NaN       7   72000
7   11     7.0       8   80000